package oop.person;

/**
 * * Ունենք Person class որն ունի անուն, աշխատավայր եւ տարիք։
 * * Գրել ֆունկցիա, որը տրված մարդկանց զանգվածից կառանեձնեցնի
 * * - այն մարդկանց ովքեր աշխատում են պարամետրով փոխանցված աշխատավայրում +
 * * - ամենատարեց եւ ամենաերիտասարդ մարդուն +
 * * - բոլոր մարդկանց տարիքներից կվերադարձնի ամենաշատ կրկնվող տարիքը +
 * * - կսորտավորի մարդկանց. ըստ տարիքի +
 * * - կսորտավորի մարդկանց. ըստ անունի - +
 * * - կսորտավորի մարդկանց. ըստ աշխատատեղի - +
 * * - կվերադարձնի կրկնվող մարդուն կամ մարդկանց (այսինքն, ընդունենք, որ  կարա նույն մարդը կարա կրկնվի զանգվածում)
 */
public class Main {
    public static void main(String[] args) {
        for (Person person : PersonRepository.getData()) {
            System.out.println(person);

        }
        System.out.println("++++++++++++++++++++++++++++++++++++++++");

        for (Person person : PersonApi.getPersonByCompany("AKNA")) {

            System.out.println(person);


        }
    }
}


//ունենք կենդանիներ  խառը 3 տիպի ցամաք ջրային օդային․․․․ունենք մարդիկ խառը սպիտակ սև․․․
//ընդհանուր ձեն հանել,տեսնել,սնվել,շնչել
//մարդը կարա կոնկրետ կենդանատեսակներ ուտի
//միջին կյանքի տևողությունը
//ձկներինը 5
//թռչուններինը 15
//ցամաքային 25
//կրիա
//ձուկը եթե տարին չի լրացել մարդու ուտում ա




